[
	{
		"userName": "Arundati Muralidharan",
		"userid": "#6689am",
		"title": " Let's talk menstruation!",
		"content": "Here's why. India is home to around 120 million adolescent girls— that's roughly 10% of the population. A girl menstruates on an average for five days a month, 12 months a year, and the cycle carries on till she reaches menopause in 30-40 years. Periods are normal and healthy, yet many girls across rural and urban India struggle to manage this monthly occurrence. The statistics are stark and dismal: 88% of girls and women who menstruate use unsafe materials; 66% of girls are unware of menstruation before their first period; 70% mothers think periods are dirty; 66% girls and women manage periods without toilets. Handling a normal physiological event is hugely complex, influenced by socio-cultural norms and the larger political environment that shape how girls experience their periods, what they can do while menstruating, what they can use to absorb menstrual blood and how they dispose the material, whether and from whom they can seek information and help, and even whether they stay in school or not. When a girl faces obstacles in managing her menses in a healthy way, she is at risk for infection, her self-esteem and self-confidence suffer, she may remain absent from school during her period, or worse still, drop out of school altogether upon reaching puberty. Over time, these negative effects add up, preventing a young girl from achieving her full potential and having a healthy, productive life. So what are we, as professionals, doing to help girls have healthy and safe periods?\nLet us break down what it takes for a girl to manage her periods in a healthy way that respects and upholds her dignity, and privacy. We need “hardware”, “software”, and a conducive environment that supports these elements while empowering girls. Software includes information about, favourable social norms and healthy attitudes towards menstruation. A girl need to know why she has periods and what is happening to her body when she menstruates. She needs to be aware about the range of safe and hygienic menstrual absorbents available — both reusable and disposable. Negative and harmful menstruation related social norms and taboos can perpetrate a culture of silence and negative attitudes, and should be addressed to ease long term repercussions. The hardware includes adequate water, sanitation, and hygiene (WASH) facilities (including disposal systems), and safe and hygienic materials to absorb menstrual blood. When girls have access to adequate hardware they can use clean menstrual absorbents, and can wash up with clean water, and change the  cloth or pad as many times as required in a safe and private space. A supportive environment is essential if girls are to use and benefit from the software and hardware available to them. This enabling environment is complex, encompassing a multitude of influencers who affect the girl directly and indirectly. Menstruation is private, but most girls are constantly negotiating societal norms and public policy that impinge on them. Parents, siblings, community members, including men and boys, have a strong impact on how girls perceive and manage their periods. Teachers, health care providers, and others who come in contact with girls through schools, health centres also shape her experiences. These influencers come from the same communities as an adolescent girl, experience similar sets of constraints related to periods, and play a pivotal role in perpetrating a culture of silence and shame around this issue.  At a slightly removed, though no less critical level, are government/policy makers, NGOs, and donor agencies. Their decisions on policies and programs impacts whether girls will have access to and can afford the information, materials, facilities, and support needed for healthy periods. For instance, Prime Minister Narendra Modi's clarion call for all schools to have girls' toilets has led to intensive efforts across the country to equip schools with such facilities.\n So far, the WASH sector has taken the lead on MHM. More recently, entrepreneurs have been innovating menstrual products, and the education sector has come on board as schools are a great platform to reach girls. These efforts are commendable, bringing attention to a much ignored issue. Action however, has centred to a great extent on hardware, which though necessary, is by itself insufficient to promote MHM. Girls will continue to struggle with menstruation till they lack information, and deep set, harmful social norms remain unaddressed. The health and women empowerment sectors can play a critical role in addressing these aspects and enabling girls to make informed decisions.\nMenstruation matters to our girls, and it should matter to everyone, everywhere. We experience it and we shape its experience. As influencers, development professionals, and policy makers, we must take action now. Period.",
		"upvotes": 549,
		"downvotes": 6,
		"tag": "periods"
	},
	{
		"userName": "Shanaya Mathur",
		"userid": "6456sm",
		"title": "7 Drinks To Help Reduce Period Cramps",
		"content": "Anyone with a uterus knows that menstruation is not for the weak. Your monthly cycle often comes with fatigue, mood swings, bloating, headaches, and, of course, the infamous uterine cramps.\nMenstrual cramps are caused by natural hormone-like substances called prostaglandins, which trigger contractions and inflammation inside the womb. Needless to say, it's an uncomfortable time of the month that calls for supportive actions, such as increased rest, heated bean bags, and soothing drinks.\n When you're feeling tender and need some comfort, reaching for a menstruation-friendly drink can help boost energy levels, decrease bloating, and, most importantly, ease menstrual cramping.\nHere are seven easy-to-make hot and cold drinks you can make at home to support your body during your period.\n\nWater\n When it comes to naturally restorative drinks, water will always be at the top of the list. No matter what your body goes through, proper hydration means being more equipped to manage any type of physical discomfort—including menstrual cramps.\n Water helps prevent bloating, reduces fatigue, and supports the circulation system for a faster, less painful bleed. Aim to drink between 1.5 and 2 liters of water on the days before and during your period.\n\nHot Chocolate\nDark chocolate with 70% cocoa or higher has a surprisingly rich and diverse nutrient content. It contains significant volumes of magnesium, iron, potassium, and antioxidants that help regulate blood flow, hormonal fluctuations, and pain management.\nHowever, now is not the time to reach for a sugary, highly processed hot chocolate product from the store. Most brands contain very little actual cocoa and are often supplemented by synthetic flavorings, which only make you feel worse. Instead, opt for a healthier version at home.\nYou can make yourself a comforting cup of menstruation-friendly hot chocolate by combining melted dark chocolate or pure cocoa powder, a bit of vanilla, a tiny pinch of salt, honey, and milk.\n\nGinger and Lemon Tea\nIf you're feeling bloated, sore, and nauseous, a steaming cup of ginger and lemon tea can help. Ginger is renowned for its uplifting anti-inflammatory properties that relieve menstrual cramps and even soothe an upset stomach. Some studies even suggest ginger is as effective as ibuprofen for muscle pain.\n Fresh lemon also comes with powerful health benefits. Naturally alkaline, lemon is great for soothing the stomach upset that often arrives with your period, and it pairs well with ginger both taste-wise and nutritionally for uterine support.\nCombine fresh, grated ginger and a generous squeeze of lemon with hot water for the best results. Add a natural sweetener like honey if you prefer.\n\nTurmeric Milk\nAlso known as golden milk, this anti-inflammatory elixir is comfort in a cup. Turmeric is packed with powerful antioxidants and anti-inflammatory compounds that work wonders for menstrual cramps and a wide variety of other common ailments.\n Although better fresh, powdered turmeric is far easier to find at the grocer and will be plenty effective in a warm drink. Combine and heat ½ teaspoon of turmeric with a dash of cinnamon, a cup of milk (any variety will do), honey, and a crack of black pepper in a saucepan for a delicious, soothing drink.\n\nCarrot and Orange Juice\n High fruit consumption has been linked to reduced period pain. Both oranges and carrots are rich in vitamin C, which plays a crucial role in how the body absorbs iron. This makes them ideal fruits to consume while on your period—a time when you tend to lose a lot of iron through cervical bleeding.\n Drinking carrot and orange juice will not only deliver a healthy dose of vitamin C but also come loaded with magnesium and potassium, which alleviate painful cramps and contractions. These two fruits pair well as a whole juice, but you can also drink plain orange or plain carrot for similar results.\n \nChamomile Tea\nChamomile tea is often used as a natural sleep aid. But its benefits don't stop there. The compounds found within this floral tea (glycine and hippurate) have been linked to the relief of muscle spasms.\nThis helps the uterine muscles relax, resulting in less cramping and tension. Chamomile tea also has an anti-inflammatory effect on the body, helping to further reduce any pain. The subtly sweet flavor of this tea makes it a very soothing drink, perfect for winding down with a movie at the end of the day.\n\nGreen Smoothie\nGreen fruits and veggies are always good for you, but they're even better during your period. Drinking a delicious, fresh green smoothie at the start of your day or even as a pick-me-up snack will deliver an enormous nutritional boost that helps combat period-related ailments.\n Dark leafy greens like spinach and kale contain iron and magnesium, while kiwi and bananas are loaded with antioxidants, zinc, and fiber. Simply blend frozen or fresh bananas with some leafy greens, kiwi, ice, lemon juice, honey, and the milk of your choice for a glass of creamy green goodness.\n A smoothie containing green fruit and veg will not only help alleviate cramping but can also be used to reduce stress and restore mental and physical energy.\n\nDrinks To Avoid While Menstruating\n When it comes to managing period-related discomfort through food and drink, knowing what not to consume is crucial.\nThese three drinks are best avoided while menstruating, as studies show they may only intensify cramping, headaches, bloating, and hormonal flux\n. High-sugar drinks (soda, energy drink. Alcohol\n Caffeine\n While it can be difficult to deny yourself treats when your uterus feels like a pit of fire, exercising self-control in this area will ultimately contribute to an easier and less painful period.\nDrink Your Way To A Less Painful Period\n Periods are a less-than-fun part of life, but you can make them less painful by being selective about what you put in your body. These drinks are delicious, easy to make, and designed with good uterine health in mind.\nIf you're taking a contraceptive pill or keeping a close watch on your cycle, you can even start drinking them in the lead-up to your period for extra relief.Staying hydrated, healthy, and well-rested will make every part of your period a little bit better. And if doing so tastes good too, what's not to like?\n",
		"upvotes": 455,
		"downvotes": 13,
		"tag": "periods"
	},
	{
		"userName": "Amy Morrison",
		"userid": "#7642am",
		"title": "Your Pregnant Body - 20 Things They Don't Tell You",
		"content": "1) You May Have Sore Boobs\nOne of the first pregnancy symptoms that many women experience is sore boobs. Essentially your body sends a memo upstairs saying the eagle has lande and your breasts turn to each other and say This is what we've been training for! Not holding up tube tops. Not getting free drinks. It's showtime!” Then they flip the switch and start getting ready for milk production. Extra blood flow fat production (hello awesome rack) and hormones all make for tender tatas especially in the first few weeks.\n2. Your Nipples May Protrude and You Areolas May Darken\nAh yes creepy guys around the world just said “nice” to this little extra feature.\nOnce again your breasts are gung ho about the baby news so they want to make sure everything is ready to roll - they are like an enthusiastic grandmother stocking up on toys - so they turn on the perma high beams and that can be uncomfortable.\nYour areolas also tend to get darker larger and jack up the little sweat gland bumps that will lube up the area when you're breastfeeding.\nWhile both have a bit of a ‘belch' factor for some women it's completely normal so don't sweat it too much.\n3. You May Have Extra Spit\nFile this one under pregnancy side effects that we can't fully explain.\nWe do know it seems to affect quite a few women during pregnancy. Hormones seem to be blamed for the cause because it's the go-to reason for most things during pregnancy. Nausea also is a plausible reason as well because extra saliva is typically the body's warning mechanism to tell you to get ready to barf.\nLong and short of it is it doesn't affect your pregnancy in any way so don't worry about it because it's perfectly normal.\nUnless of course you're not actually pregnant in which case both rabies and dementia can cause excess saliva. So you know check that out.\n4. You May Be Constipated\nYou have extra progesterone pumping through you right now and it's pretty important - hence the name that means “pro gestating” - because it relaxes your uterus muscles so you don't have early contractions (just to name one of its important jobs).\nThe downside is that it helps relax all your muscles so you get constipated easily.\n“Wouldn't relaxed muscles actually give me diarrhea?” you say. Oh contraire my Petal. Your intestinal tract actually works very hard to move stuff through so once they get a little lazy shit stops moving. Literally. Shit stops moving.\nMove more drink water eat small meals and increase your fiber intake seems to be the suggested course of action (and for more tips check out our post on it here). You may as well commit this phrase to memory because it is pretty much the remedy suggested for EVERY. SINGLE. PREGNANCY AILMENT. ON THE PLANET.\nConstipation During Pregnancy\nPregnancy constipation is a literal pain in the buns. Here are tips natural remedies and foods that can all help relieve constipation.\nPregnant Chicken\nEmily Ramirez\n\nJust don't use laxatives (or at least talk to a medical provider before you do) because they can screw things up even more and there may be an easier fix before you go that route.\nThis is also a nice segue into our next delightful treat….\n5. You Might Get Hemorrhoids\nCongratulations you're slowly turning inside out! Weeee!\nAlthough it may seem like your body is dropping out of your ass hemorrhoids are actually veins in and around your rectum becoming swollen and can affect up to 50% of pregnant women. Lucky! Lucky! (More about these delightful gems including pregnancy-safe tips and tricks for dealing with them can be found here.)\nHemorrhoids During Pregnancy: Safe Tips Tricks and Treatments\nHemorrhoids. Super sucky. Super common. Read on for pregnancy-safe tips and tricks for dealing with that pity party in your pants.\nPregnant Chicken\nEmily Ramirez\nYour growing uterus and increased blood flow are usually the culprits but both constipation and delivery can cause them as well. They can run the gamut from itching to downright painful but thankfully they usually resolve themselves after pregnancy.\nLying down on your side also helps keep the pressure off that area so cue up a good movie and put it in park for the sake of your butt.\nAnd guess what? Drinking plenty of water and increasing your fiber intake helps. Who knew?!\n6. You May Be Congested\nSome women suffer from nasal congestion during their pregnancy and it can be a huge drag. Estrogen causes the mucous membranes in your nose to swell along with everything else so it can cause congestion and even nosebleeds.\nSo pretty. Nothing quite like a pregnant woman walking around looking like she stepped out of a UFC Octagon.\nOh I should also mention that this also may cause snoring when you sleep as well.\n“Oh snap is that a Victoria's Secret model sleeping next to me?” is without question what your partner will be asking themselves on a nightly basis… if they're smart.\n7. You May Have Heartburn\nRemember that awesome hormone progesterone that relaxes your uterus so it doesn't eject your baby like a 007 car? Well it's also relaxing a muscle called the lower esophageal sphincter. This loosening can cause stomach acid to back up into your esophagus.\nWhether it's called acid indigestion acid reflux or heartburn it can feel like you're gargling battery acid and it's awful.\nThankfully this throat valve goes back to keeping the fires at bay once you've given birth. In the meantime here are some remedies and meds that may help.\nHow to Get Rid of Pregnancy Heartburn (Fast!)\nPregnancy heartburn and acid reflux suck. Here are the causes and a variety of tricks remedies and safe medications to keep the burn at bay.\nPregnant Chicken\nAmy Morrison\n8. You Might Suffer From Leg Cramps\n Arrrgh leg cramp! is something you may utter when you're pregnant. Most likely it will be when you finally get to sleep after your heartburn subsides and your nose clears.\nNo one knows what causes this delightful pregnancy side effect.* The possible culprits are compressed blood vessels or just the pressure of carrying around more weight. Either way they are painful and wrench you out of a glorious sleep like an air horn. The quickest trick to relieve them is to flex your foot upwards and straighten your leg like you're going to touch your shin with your big toe.\n* Yet there was a study to see if rats could tell the difference between Japanese and Dutch. Spoiler alert: they can but not when spoken backward. Thanks Science you suck today.\n9. You Might Get Restless Leg Syndrome:\nRestless leg syndrome is not dangerous or a sign that anything is wrong but it can be uncomfortable and disrupt your sleep.\nNo one really knows what causes the Jimmy legs (see rat study above) but it's one of the more common pregnancy side effects. It tends to happen at night affecting the lower legs between the knee and ankle although it can also occur in your feet and arms.\nStretching warms baths acupuncture and massage seem to be the suggested remedies but also mention it to your healthcare provider because they may want to check your iron levels to make sure you aren't sporting a deficiency.\nSome women keep a food journal to see if something they eat (typically later in the day) is triggering the jumpy legs at night. It's certainly worth a shot. I suppose you could take up clogging or Celtic dance too. Here are some more ideas and suggestions.\nHandling Restless Leg Syndrome During Pregnancy\nRLS is a strong or uncontrollable desire to move your legs. They may feel like they're tingling or burning - or they might just feel uncomfortable.\nPregnant Chicken\nHeather Dixon\n",
		"upvotes": 434,
		"downvotes": 2,
		"tag": "pregnancy"
	},
	{
		"userName": "Regia Lorren",
		"userid": "#7834gy",
		"title": "While you were sleeping: I watched you transform into a toddler",
		"content": "While you were sleeping, I took a sigh of relief that finally, my sweet wild child, finally you were resting.\nWhile you were sleeping, I had dishes piled and laundry overflowing, but instead I just laid beside you, peaceful and still.\nWhile you were sleeping, I just stared at you, in awe, that something so perfect could come from me.\nWhile you were sleeping, I watched your tiny chest move up and down, and when your breathing would slow, I placed my ear to your mouth to ensure I could hear your tiny breaths.\nWhile you were sleeping, I prayed over you. I thanked God at least 100 times that you were here and healthy, but most of all—that you were mine.\nWhile you were sleeping, I noticed your onesie was almost too small for you. This was probably the last time I would ever see you in that.\nWhile you were sleeping, I smiled as I gently ran my fingers through your messy hair. I've never seen another human pull off tangled hair as perfectly as you.\nWhile you were sleeping, my heart ached at the thought that before long, you wouldn't need naps anymore, and the times for you and I to just be still together, well…would be few and far between.\nWhile you were sleeping, I realized that it's possible to miss someone even while you're sitting right next to them. You tired me all day long, but I do—I miss you and your smile and sweet giggles.\nWhile you were sleeping, I almost picked you up, as I just wanted to rock you while you still fit in my arms and lay perfectly atop of my chest.\nWhile you were sleeping, it hit me—as my heart was throbbing and tears swelled within my eyes—I saw a toddler rather than a baby.\nWhile you were sleeping, I watched my fourth and final baby, transform right before my eyes.\nToday I'm so glad I took the time to be next to you, my sweet baby…while you were sleeping.",
		"upvotes": 3453,
		"downvotes": 23,
		"tag": "mother-and-baby"
	},
	{
		"userName": "Riya Sen",
		"userid": "#9968gy",
		"title": "Vulva Washes: Boon or Bane?",
		"content": "To understand that, we should first discuss how different parts of our body have different needs. Would you use hand wash to wash your face? We hope not, because the skin on your face and neck is very sensitive and must be handled gently. Your nether regions are the same: made up of very sensitive skin and often prone to infections and irritation due to poor hygiene and neglect. Most commercial shower bars and shower gels are often too harsh for the skin on your genitals and can even end up messing with the PH level of the vagina! To address this specific issue, intimate washes were formulate.\n\nThe vagina is a self-cleaning organ, so why the need for intimate wash products? Well, the simple explanation is that intimate washes are not meant to be used internally! The intention of intimate wash products is to clean the outer regions of the female genitalia, such as the vulva, clitoris, and labia, which are sensitive to harsh chemicals and perfumes. A good intimate wash should be gentle in nature, to help clean the sensitive skin of your genitals, and have a PH balanced, chemical-free formula in order to not interfere with your vaginal PH levels.\n\nIf you're wondering if you should be using an intimate wash, consider this: Our genitalia is located in a rather precarious location, which is often smothered with tight or damp underwear (especially during menstruation) and low ventilation. This is the perfect breeding ground for bacteria, viruses, and fungal infections to thrive. Intimate region washes are encouraged to minimize this exposure to infections and even lessen the risk of contracting UTIs! Unless you suffer from a condition that prevents you from using one, we believe that intimate washes must be a part of every woman's self-care routine!\n\nThe Imbue Natural Intimate Hygiene Wash for women and Imbue Natural Intimate Hygiene Vaginal Foam for women are carefully formulated to address the many issues faced by women. It contains the goodness of naturally sourced, native herbs and ingredients like Tea Tree extract, Neem extract, and Banyan Fig. Tea tree oil helps to prevent unwanted infections which irritate and dry the skin, and Neem extract has anti-fungal, antibacterial, and anti-viral properties due to which it is found in Ayurveda and other ancient Indian medicine. Banyan fig also helps to keep infections at bay while improving the odor in your genitalia.",
		"upvotes": 3433,
		"downvotes": 233,
		"tag": "personal-hygiene"
	},
	{
		"userName": "Kalie Jones",
		"userid": "#8574bx",
		"title": "5 ways to take care of your intimate area",
		"content": "We sure talk a lot about our physical health. The conversation around mental health is also picking up pace, but what about our intimate health? That is something that is still not discussed as much as it should be.  The stigma attached to women's bodies, especially their intimate body parts has led to a culture where intimate health as well hygiene concerns are neither talked about nor is it taken seriously. This tendency can be quite dangerous in the long term because your intimates are an integral part of your body. Therefore the health of your intimate body parts and their wellness will also have an overall impact on your entire health. \n\nHowever, it will be unfair to pass the judgement that things are exactly as they were half a decade ago, Situations and circumstances are definitely changing. The number of commercials regarding intimate care products like intimate hygiene washes or natural vaginal wash bears evidence to the fact that things are slowly but surely changing. The conversation around intimate care and hygiene is slowly gaining pace and this is definitely a welcome trend.\n\nSo let us go ahead and see what are the 5 best ways to take care of your intimate area\n\nUsing Intimate Hygiene Wash: Whether you talk about television or the internet chances are you must have come across advertisements of intimate hygiene wash products. So what are they? These intimate Hygiene products have been specially formulated keeping the sensitivity of your intimate areas. Regular soaps or washes can cause irritation if used in your intimate region as they can mess up the pH of your vagina. However, these products are gentle to your intimate areas and take care of them without causing any kind of damage\n\n Clean properly: Make sure to always keep your vagina clean and dry. This involves washing your intimate areas post peeing. And the way to do that is to wash it from the anal region to the vagina. This prevents UTIs. Cleanliness during sexual intercourse is also important to maintain your intimate hygiene. This includes peeing after sex as this also goes a long way in preventing UTIs\n\nTake menstrual hygiene seriously: Periods might be the most annoying occurrence for most vagina owners. However, as much as we hate them, for most of us, there's hardly any escaping from them. One of the ways to ensure comparatively stress-free periods is to maintain proper menstrual hygiene. Changing sanitary pads, tampons, at regular intervals. A lot of us may feel when it comes to changing our pads or tampons, However, wearing used sanitary products can have detrimental effects on your body in the long run. If you use menstrual cups properly, cleaning and sterilizing them before and after using them becomes an important part of your intimate hygiene. Following these small steps will not only help you have a clean and irritation-free period but will also contribute greatly to maintaining your intimate hygiene overall.\n\n Stay away from douching: Douching is a method of flushing water up to your vagina in an attempt to clean it. Many believe that douching can also help prevent STDs and STIs\n However, this is completely unnecessary and even detrimental. There is absolutely no evidence to the fact that douching prevents any kind of STIs or will guarantee absolute cleanliness of your vagina\nThe vagina is self-cleaning. You don't have to put anything inside your vagina to clean it. If anything douching can mess up the pH of your vagina by flushing out the good bacteria which help is essential to maintain the acidic nature of your vagina.  So do your intimates a favour and stay away. \n Pay regular visits to your gynaecologist: Meetings with gynaecologists can be quite scary and that's why most of us avoid visiting our gynac. However, that might not be the best route to take when it comes to the well being of your intimate regions.  Many a time we ourselves cannot decipher if our sexual and intimate health is on point. So having regular visits with our gynaecologist is a good way to ensure that any kind of infections down there are kept at bay and our vaginal remains happy and healthy\nJust like we take care of your physical and mental health, taking care of our intimate health is equally important. Use the best intimate wash for women, maintain menstrual hygiene, avoid douching and visit your gynac regularly. Trust us your vagina will be thanking you for this",
		"upvotes": 6546,
		"downvotes": 34,
		"tag": "personal-hygiene"
	}
]
